# На всеки четен етаж има само офиси;
# На всеки нечетен етаж има само апартаменти;
# Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента},
#номерата на апартаментите започват от 0;
# Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на
#офисите също започват от 0;
# На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера
#им пише &#39;L&#39;, вместо &#39;А&#39;. Ако има само един етаж, то има само големи апартаменти!
#От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.

floors = int(input())
rooms = int(input())

for floor in range(floors,0, -1):
    for room in range(0, rooms):
        if floor == floors:
            print(f"L{floor}{room}", end=" ")
        elif floor % 2 == 0:
            print(f"O{floor}{room}", end=" ")
        else:
            print(f"A{floor}{room}", end=" ")
    print(" ")

